def is_preposition(token):
    """
    returns True if token is in the list of prepositions
    """
    prepositions = [
        "без", "в", "вне", "во", "для", "до", "за", "из", "из-за", "из-под", "к", "ко",
        "меж", "между", "мимо", "на", "над", "надо", "о", "об", "обо", "около", "от", "ото",
        "перед", "передо", "по", "под", "перед", "при", "про", "ради", "с"
    ]
    return token in prepositions

def is_conjunction(token):
    """
    returns True if token is in the list of conjunctions
    """
    conjunctions = [
        "а", "будто", "ведь", "всё-таки", "где", "да", "дабы", "даже", "едва",
        "если", "ещё", "ж", "же", "зато", "зачем", "значит", "и", "или", 
        "ибо", "иль", "иначе", "итак", "как", "кабы", "когда", "коли", "коль",
        "который", "куда", "ли", "либо", "лишь", "настолько", "нежели", "ни", "но",
        "однако", "откуда", "оттого", "отчего", "пока", "покамест", "поскольку", 
        "постольку", "потому", "притом", "причём", "пусть", "раз", "разве", 
        "сколько", "столько", "словно", "также", "только", "тоже", "то",
        "хоть", "хотя", "чем", "что", "чтоб", "чтобы", "якобы"
    ]
    return token in conjunctions